Tekla Open API Reference for Tekla Structures 2025
RebarCranking.CrankedLengthTypeEnum Enumeration
 The cranked length type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum CrankedLengthTypeEnum
Public Enumeration CrankedLengthTypeEnum
Members
Member name | Value | Description
DIAGONAL_RATIO | 0 |  Diagonal ratio.
DIAGONAL_DISTANCE | 1 |  Diagonal distance.
HORIZONTAL_RATIO | 2 |  Horizontal ratio.
HORIZONTAL_DISTANCE | 3 |  Horizontal distance.
See Also
Reference
Tekla.Structures.Model Namespace